share/tutorials/incompressible/simple/pitz_daily/0/U
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           uniform (10 0 0);
  }
  outlet
  {
    type            zeroGradient;
  }
  upperWall
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  lowerWall
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
