share/tutorials/incompressible/simple/pitz_daily/0/f
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      v2;
}

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  inlet
  {
    type            zeroGradient;
  }
  outlet
  {
    type            zeroGradient;
  }
  upperWall
  {
    type            fWallFunction;
    value           uniform 0;
  }
  lowerWall
  {
    type            fWallFunction;
    value           uniform 0;
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
