share/tutorials/incompressible/simple/pitz_daily/0/k
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.375;

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           uniform 0.375;
  }
  outlet
  {
    type            zeroGradient;
  }
  upperWall
  {
    type            kqRWallFunction;
    value           uniform 0.375;
  }
  lowerWall
  {
    type            kqRWallFunction;
    value           uniform 0.375;
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
