share/tutorials/incompressible/simple/pitz_daily/0/v2
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      v2;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.25;

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           $internalField;
  }
  outlet
  {
    type            zeroGradient;
  }
  upperWall
  {
    type            v2WallFunction;
    value           $internalField;
  }
  lowerWall
  {
    type            v2WallFunction;
    value           $internalField;
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
