share/tutorials/incompressible/simple/pitz_daily/constant/turbulenceProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      turbulenceProperties;
}

simulationType RAS;
RAS
{
  // Tested with kEpsilon, realizableKE, kOmega, kOmegaSST, v2f,
  // ShihQuadraticKE, LienCubicKE.
  RASModel        kEpsilon;
  turbulence      on;
  printCoeffs     on;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
