share/tutorials/incompressible/simple/pitz_daily/system/fvSchemes
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSchemes;
}

ddtSchemes
{
  default         steadyState;
}
gradSchemes
{
  default         Gauss linear;
}
divSchemes
{
  default         none;
  div(phi,U)      bounded Gauss linearUpwind grad(U);
  div(phi,k)      bounded Gauss limitedLinear 1;
  div(phi,epsilon) bounded Gauss limitedLinear 1;
  div(phi,omega)  bounded Gauss limitedLinear 1;
  div(phi,v2)     bounded Gauss limitedLinear 1;
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
  div(nonlinearStress) Gauss linear;
}
laplacianSchemes
{
  default         Gauss linear corrected;
}
interpolationSchemes
{
  default         linear;
}
snGradSchemes
{
  default         corrected;
}
wallDist
{
  method meshWave;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
